name : Safe Attachments 
description : 
- Audit the config - [Safe Attachments for SharePoint, OneDrive, and Microsoft Teams]
- https://learn.microsoft.com/en-us/microsoft-365/security/office-365-security/safe-attachments-for-spo-odfb-teams-configure?view=o365-worldwide
query : |
   let StartTime = datetime(2023-01-22);
   let EndTime = datetime(2023-01-24);
   CloudAppEvents
   | where Timestamp between ((StartTime) .. (EndTime))
   | where Application == "Microsoft Exchange Online"
   | where ActionType contains "atp"

output : 
 Parameters 
  [
    {"Name":"Identity","Value":"Default"},
    {"Name":"EnableATPForSPOTeamsODB","Value":"True"},
    {"Name":"EnableSafeDocs","Value":"True"},
    {"Name":"AllowSafeDocsOpen","Value":"False"}
  ]