name : Installed App name & version list 
description : 
- On a Windows device, here is a list of all installed app names and their versions
table : 
- DeviceTvmSoftwareInventory
- https://learn.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-devicetvmsoftwareinventory-table?view=o365-worldwide
query : |
    //Installed App name & version list 
    DeviceTvmSoftwareInventory
    | where OSPlatform startswith "Windows"
    | summarize Installed_Software = make_set(strcat(SoftwareName, " | ", SoftwareVersion)) by DeviceName, DeviceId, OSPlatform, OSVersion
    | extend Num = array_length(Installed_Software)
    | project DeviceId, DeviceName, OSPlatform, OSVersion, Num, Installed_Software
    
    
