name : Net.exe activity list 
description : 
- This query shows all distinct activities generated by "net.exe" for each device.
table : 
- DeviceProcessEvents
- https://learn.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-deviceprocessevents-table?view=o365-worldwide
query : |
    //List all distinct command lines from Net.exe 
    DeviceProcessEvents
    | where Timestamp > ago(30d)
    | where FileName == "net.exe"
    | summarize CmdList = make_set(ProcessCommandLine) by DeviceId, DeviceName
    | extend Case = array_length(CmdList)
    | project DeviceId, DeviceName, Case, CmdList
    | order by Case desc 
