name : MDE Controlled Folder Access
source : https://github.com/LearningKijo/KQL/blob/main/KQL-XDR-Hunting/Endpoint-Microsoft-Defender-for-Endpoint/MDE-WebProtection.yaml
query: |
    //Controlled Folder Access - Block
    DeviceEvents
    | where Timestamp > ago(7d)
    | where ActionType contains "ControlledFolderAccessViolationBlocked"
    | summarize TargetFolderPath = make_list(strcat(FolderPath, " | ", InitiatingProcessFileName)) by bin(Timestamp, 1d), DeviceId, DeviceName
    | extend Num = array_length(TargetFolderPath)
    | project Timestamp, DeviceId, DeviceName, Num, TargetFolderPath


    //Controlled Folder Access - Audit
    DeviceEvents
    | where Timestamp > ago(7d)
    | where ActionType contains "ControlledFolderAccessViolationAudit"
    | summarize TargetFolderPath = make_list(strcat(FolderPath, " | ", InitiatingProcessFileName)) by bin(Timestamp, 1d), DeviceId, DeviceName
    | extend Num = array_length(TargetFolderPath)
    | project Timestamp, DeviceId, DeviceName, Num, TargetFolderPath
    
    
