name : MITRE ATTCK pivot table 
description : Providing a pivot table for MITRE ATT&CK across Microsoft 365 Defender
table : 
- AlertInfo
- https://learn.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-alertinfo-table?view=o365-worldwide
query: |
    AlertInfo
    | where Timestamp > ago(30d)
    | where ServiceSource in ("AAD Identity Protection", "Microsoft Defender for Endpoint", "Microsoft Defender for Office 365", "Microsoft Defender for Identity", "Microsoft Cloud App Security", "Microsoft 365 Defender")
    | where isnotempty(AttackTechniques)
    | mv-expand DetailedAttackTechniques= parse_json(AttackTechniques)
    | project ServiceSource, DetailedAttackTechniques
    | evaluate pivot(ServiceSource)
