name : EOP detection with Email Phish
description : 
- These queries are going to hunt for - Phish/Malware mails with Exchange Online Protection
- Case1 - EOP detection list 
- Case2 - Filter EOP detection based on detection methods
table : 
- EmailEvents
- https://learn.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-emailevents-table?view=o365-worldwide
query : |
    //Case1 - EOP detection list 
    EmailEvents
    | where Timestamp > ago(7d)
    | where isnotempty(DetectionMethods)
    | extend EOP_detection = parse_json(DetectionMethods)
    | where EOP_detection.Phish in 
      (
       @'["URL malicious reputation"]'
       @'["Advanced filter"]',
       @'["General filter"]',
       @'["Spoof intra-org"]',
       @'["Spoof external domain"]',
       @'["Spoof DMARC"]',
       @'["Impersonation brand"]',
       @'["Mixed analysis detection"]',
       @'["File reputation"]',
       @'["Fingerprint matching"]'
      )
    | project Timestamp, Subject, NetworkMessageId, SenderFromAddress, RecipientEmailAddress, DeliveryLocation, EOP_detection.Phish


    //Case2 - Filter EOP detection based on detection ethods
    EmailEvents
    | where Timestamp > ago(7d)
    | where isnotempty(DetectionMethods)
    | extend EOP_detection = parse_json(DetectionMethods)
    | where EOP_detection.Phish == @'["URL malicious reputation"]'
    //| where EOP_detection.Phish == @'["Advanced filter"]'
    //| where EOP_detection.Phish == @'["General filter"]'
    //| where EOP_detection.Phish == @'["Spoof intra-org"]'
    //| where EOP_detection.Phish == @'["Spoof external domain"]'
    //| where EOP_detection.Phish == @'["Spoof DMARC"]'
    //| where EOP_detection.Phish == @'["Impersonation brand"]'
    //| where EOP_detection.Phish == @'["Mixed analysis detection"]'
    //| where EOP_detection.Phish == @'["File reputation"]'
    //| where EOP_detection.Phish == @'["Fingerprint matching"]'
    | project Timestamp, Subject, NetworkMessageId, SenderFromAddress, RecipientEmailAddress, DeliveryLocation, EOP_detection.Phish

    
