name : MDO detection with Email Phish
description : 
- These queries are going to hunt for - Phish mails with Microsoft Defender for Office 365
- Case1 - MDO detection list 
- Case2 - Filter MDO detection based on detection methods
table : 
- EmailEvents
- https://learn.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-emailevents-table?view=o365-worldwide
query : |
    //Case1 - MDO detection list 
    EmailEvents
    | where Timestamp > ago(7d)
    | where isnotempty(DetectionMethods)
    | extend MDO_detection = parse_json(DetectionMethods)
    | where MDO_detection.Phish in 
      (
       @'["URL detonation reputation"]',
       @'["URL detonation"]',
       @'["Impersonation user"]',
       @'["Impersonation domain"]',
       @'["Mailbox intelligence impersonation"]',
       @'["File detonation"]',
       @'["File detonation reputation"]',
       @'["Campaign"]'
      )
    | project Timestamp, NetworkMessageId, Subject, SenderFromAddress, RecipientEmailAddress, DeliveryLocation, MDO_detection.Phish


    //Case2 - Filter MDO detection based on detection methods
    EmailEvents
    | where Timestamp > ago(7d)
    | where isnotempty(DetectionMethods)
    | extend MDO_detection = parse_json(DetectionMethods)
    | where MDO_detection.Phish == @'["URL detonation reputation"]'
    //| where MDO_detection.Phish == @'["URL detonation"]'
    //| where MDO_detection.Phish == @'["Impersonation user"]'
    //| where MDO_detection.Phish == @'["Impersonation domain"]'
    //| where MDO_detection.Phish == @'["Mailbox intelligence impersonation"]'
    //| where MDO_detection.Phish == @'["File detonation"]'
    //| where MDO_detection.Phish == @'["File detonation reputation"]'
    //| where MDO_detection.Phish == @'["Campaign"]'
    | project Timestamp, NetworkMessageId, Subject, SenderFromAddress, RecipientEmailAddress, DeliveryLocation, MDO_detection.Phish


